## Plan output

```
module.logging.data.aws_region.current: Reading...
module.app["dc-sebt-portal"].module.database["this"].data.aws_caller_identity.identity: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Reading...
module.logging.data.aws_caller_identity.identity: Reading...
module.app["dc-sebt-portal"].module.database["this"].data.aws_region.current: Reading...
module.logging.module.s3.data.aws_caller_identity.current: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Reading...
module.app["column-sandbox"].data.aws_cloudwatch_log_groups.ecs: Reading...
module.app["dc-sebt-portal"].module.database["this"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].module.database["this"].module.mssql["this"].module.db_instance.data.aws_partition.current: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Reading...
module.app["dc-sebt-portal"].module.database["this"].module.mssql["this"].module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Reading...
module.app["dc-sebt-portal"].module.database["this"].data.aws_caller_identity.identity: Read complete after 0s [id=816069131564]
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Reading...
module.logging.data.aws_caller_identity.identity: Read complete after 0s [id=816069131564]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Reading...
module.logging.module.s3.data.aws_caller_identity.current: Read complete after 0s [id=816069131564]
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Reading...
module.app["column-sandbox"].data.aws_cloudwatch_log_groups.ecs: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Read complete after 0s [id=2644592029]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Reading...
module.app["dc-sebt-portal"].data.aws_lambda_functions.all: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Read complete after 0s [id=1315226949]
module.app["df-all-screens-scrape"].data.aws_lambda_functions.all: Reading...
module.app["column-sandbox"].data.aws_lambda_functions.all: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Read complete after 0s [id=2187510914]
module.logging.data.aws_elb_service_account.current: Reading...
module.logging.data.aws_elb_service_account.current: Read complete after 0s [id=127311923021]
module.app["dc-sebt-portal"].data.aws_cloudwatch_log_groups.ecs: Reading...
module.app["df-all-screens-scrape"].data.aws_cloudwatch_log_groups.ecs: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Read complete after 0s [id=1808222790]
module.vpc.module.vpc.data.aws_region.current[0]: Reading...
module.vpc.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].module.secrets.data.aws_caller_identity.identity: Reading...
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.app["dc-sebt-portal"].data.aws_cloudwatch_log_groups.ecs: Read complete after 0s [id=us-east-1]
module.app["df-all-screens-scrape"].module.secrets.data.aws_caller_identity.identity: Reading...
module.app["dc-sebt-portal"].module.secrets.data.aws_caller_identity.identity: Read complete after 0s [id=816069131564]
module.app["column-sandbox"].module.secrets.data.aws_caller_identity.identity: Reading...
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=816069131564]
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Read complete after 0s [id=874300523]
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Read complete after 0s [id=3795168285]
module.logging.module.s3.data.aws_organizations_organization.current: Reading...
module.app["df-all-screens-scrape"].data.aws_cloudwatch_log_groups.ecs: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].module.database["this"].module.mssql["this"].module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.app["dc-sebt-portal"].module.database["this"].module.mssql["this"].module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.app["dc-sebt-portal"].module.database["this"].data.aws_rds_engine_version.this: Reading...
module.app["df-all-screens-scrape"].module.secrets.data.aws_caller_identity.identity: Read complete after 0s [id=816069131564]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.app["dc-sebt-portal"].data.aws_cloudwatch_log_groups.ecs_insights: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.app["dc-sebt-portal"].data.aws_cloudwatch_log_groups.rds: Reading...
module.app["column-sandbox"].module.secrets.data.aws_caller_identity.identity: Read complete after 0s [id=816069131564]
module.app["df-all-screens-scrape"].data.aws_cloudwatch_log_groups.ecs_insights: Reading...
module.app["dc-sebt-portal"].data.aws_cloudwatch_log_groups.ecs_insights: Read complete after 0s [id=us-east-1]
module.app["column-sandbox"].data.aws_cloudwatch_log_groups.ecs_insights: Reading...
module.app["dc-sebt-portal"].data.aws_cloudwatch_log_groups.rds: Read complete after 0s [id=us-east-1]
module.app["column-sandbox"].data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.app["df-all-screens-scrape"].data.aws_cloudwatch_log_groups.rds: Reading...
module.app["column-sandbox"].data.aws_cloudwatch_log_groups.rds: Reading...
module.app["df-all-screens-scrape"].data.aws_cloudwatch_log_groups.ecs_insights: Read complete after 1s [id=us-east-1]
module.app["dc-sebt-portal"].module.database["this"].data.aws_partition.current: Reading...
module.app["dc-sebt-portal"].module.database["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.app["dc-sebt-portal"].data.aws_lambda_functions.all: Read complete after 1s [id=us-east-1]
module.vpc.module.vpc.data.aws_partition.current[0]: Reading...
module.vpc.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.logging.module.s3.data.aws_region.current: Reading...
module.vpc.data.aws_availability_zones.available: Reading...
module.logging.module.s3.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.data.aws_lambda_functions.all: Reading...
module.app["df-all-screens-scrape"].data.aws_lambda_functions.all: Read complete after 1s [id=us-east-1]
module.logging.data.aws_partition.current: Reading...
module.logging.data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.module.s3.data.aws_partition.current: Reading...
module.logging.module.s3.data.aws_partition.current: Read complete after 0s [id=aws]
module.app["column-sandbox"].module.secrets.data.aws_region.current: Reading...
module.app["column-sandbox"].module.secrets.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app["df-all-screens-scrape"].module.secrets.data.aws_region.current: Reading...
module.app["df-all-screens-scrape"].module.secrets.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].module.secrets.data.aws_region.current: Reading...
module.app["column-sandbox"].data.aws_cloudwatch_log_groups.ecs_insights: Read complete after 1s [id=us-east-1]
module.app["dc-sebt-portal"].module.secrets.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].module.secrets.data.aws_partition.current: Reading...
module.app["df-all-screens-scrape"].module.secrets.data.aws_partition.current: Reading...
module.app["dc-sebt-portal"].module.secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.app["df-all-screens-scrape"].data.aws_cloudwatch_log_groups.rds: Read complete after 0s [id=us-east-1]
module.app["df-all-screens-scrape"].module.secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.app["column-sandbox"].module.secrets.data.aws_partition.current: Reading...
module.app["column-sandbox"].module.secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.app["column-sandbox"].data.aws_cloudwatch_log_groups.rds: Read complete after 0s [id=us-east-1]
module.logging.data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.logging.module.s3.data.aws_organizations_organization.current: Read complete after 1s [id=o-f5mr0gq6lc]
module.app["dc-sebt-portal"].data.aws_lambda_function.datadog["this"]: Reading...
module.app["df-all-screens-scrape"].data.aws_lambda_function.datadog["this"]: Reading...
module.app["column-sandbox"].data.aws_lambda_function.datadog["this"]: Reading...
module.logging.data.aws_lambda_function.datadog["this"]: Reading...
module.app["dc-sebt-portal"].data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-W7KLT9-Forwarder-VufEAiofNX9f]
module.app["df-all-screens-scrape"].data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-W7KLT9-Forwarder-VufEAiofNX9f]
module.app["column-sandbox"].data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-W7KLT9-Forwarder-VufEAiofNX9f]
module.logging.data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-W7KLT9-Forwarder-VufEAiofNX9f]
module.logging.module.s3.data.aws_iam_policy_document.default: Reading...
module.logging.module.s3.data.aws_iam_policy_document.default: Read complete after 0s [id=3580588753]
module.app["dc-sebt-portal"].module.database["this"].data.aws_rds_engine_version.this: Read complete after 2s [id=16.00.4185.3.v1]
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Reading...
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Read complete after 0s [id=us-east-1]
module.logging.module.s3.data.aws_iam_policy_document.combined: Reading...
module.logging.module.s3.data.aws_iam_policy_document.combined: Read complete after 0s [id=199516603]
module.vpc.data.aws_subnets.endpoints["ec2"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Read complete after 0s [id=us-east-1]
module.app["df-all-screens-scrape"].module.service["web"].data.aws_caller_identity.identity: Reading...
module.app["column-sandbox"].module.service["web"].data.aws_caller_identity.identity: Reading...
module.app["dc-sebt-portal"].module.service["web"].data.aws_caller_identity.identity: Reading...
module.app["df-all-screens-scrape"].module.service["web"].data.aws_partition.current: Reading...
module.app["df-all-screens-scrape"].module.service["web"].data.aws_partition.current: Read complete after 0s [id=aws]
module.app["column-sandbox"].module.service["web"].data.aws_partition.current: Reading...
module.app["column-sandbox"].module.service["web"].data.aws_partition.current: Read complete after 0s [id=aws]
module.app["dc-sebt-portal"].module.service["web"].data.aws_partition.current: Reading...
module.app["dc-sebt-portal"].module.service["web"].data.aws_partition.current: Read complete after 0s [id=aws]
module.app["df-all-screens-scrape"].module.service["web"].data.aws_caller_identity.identity: Read complete after 0s [id=816069131564]
module.app["column-sandbox"].module.service["web"].data.aws_caller_identity.identity: Read complete after 0s [id=816069131564]
module.app["df-all-screens-scrape"].module.service["web"].data.aws_region.current: Reading...
module.app["dc-sebt-portal"].module.service["web"].data.aws_region.current: Reading...
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Read complete after 0s [id=us-east-1]
module.app["df-all-screens-scrape"].module.service["web"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].module.service["web"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app["column-sandbox"].module.service["web"].data.aws_region.current: Reading...
module.app["column-sandbox"].module.service["web"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].module.service["web"].data.aws_vpc.current: Reading...
module.app["dc-sebt-portal"].module.service["web"].data.aws_route53_zone.domain["this"]: Reading...
module.app["df-all-screens-scrape"].module.service["web"].data.aws_vpc.current: Reading...
module.app["column-sandbox"].module.service["web"].data.aws_vpc.current: Reading...
module.app["dc-sebt-portal"].module.service["web"].data.aws_caller_identity.identity: Read complete after 0s [id=816069131564]
module.app["df-all-screens-scrape"].module.service["web"].data.aws_route53_zone.domain["this"]: Reading...
module.app["column-sandbox"].module.service["web"].data.aws_route53_zone.domain["this"]: Reading...
module.app["df-all-screens-scrape"].module.service["web"].data.aws_secretsmanager_secret_version.oidc["this"]: Reading...
module.app["column-sandbox"].module.service["web"].data.aws_secretsmanager_secret_version.oidc["this"]: Reading...
module.app["df-all-screens-scrape"].module.service["web"].data.aws_secretsmanager_secret_version.oidc["this"]: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:816069131564:secret:df-all-screens-scrape/development/oidc-20250623183809209800000001-j7Kc8D|AWSCURRENT]
module.app["column-sandbox"].module.service["web"].data.aws_secretsmanager_secret_version.oidc["this"]: Read complete after 1s [id=arn:aws:secretsmanager:us-east-1:816069131564:secret:column-sandbox/development/oidc-20250625192121498600000001-LEsWCH|AWSCURRENT]
module.app["dc-sebt-portal"].module.service["web"].data.aws_route53_zone.domain["this"]: Read complete after 1s [id=Z0097236342AE196VY5TV]
module.app["column-sandbox"].module.service["web"].data.aws_route53_zone.domain["this"]: Read complete after 1s [id=Z088564232NGJRO0LYHKL]
module.app["df-all-screens-scrape"].module.service["web"].data.aws_route53_zone.domain["this"]: Read complete after 1s [id=Z088564232NGJRO0LYHKL]
module.app["df-all-screens-scrape"].module.service["web"].module.alb["this"].data.aws_partition.current: Reading...
module.app["df-all-screens-scrape"].module.service["web"].module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.app["df-all-screens-scrape"].module.service["web"].data.aws_vpc.current: Read complete after 1s [id=vpc-024d66fcc4f521d0a]
module.app["dc-sebt-portal"].module.service["web"].data.aws_vpc.current: Read complete after 1s [id=vpc-024d66fcc4f521d0a]
module.app["column-sandbox"].module.service["web"].module.alb["this"].data.aws_partition.current: Reading...
module.app["column-sandbox"].module.service["web"].module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.app["dc-sebt-portal"].module.service["web"].module.alb["this"].data.aws_partition.current: Reading...
module.app["dc-sebt-portal"].module.service["web"].module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.app["column-sandbox"].module.service["web"].data.aws_vpc.current: Read complete after 1s [id=vpc-024d66fcc4f521d0a]
module.app["dc-sebt-portal"].module.service["web"].module.ecr["this"].data.aws_caller_identity.current: Reading...
module.app["dc-sebt-portal"].module.service["web"].module.ecr["this"].data.aws_caller_identity.current: Read complete after 0s [id=816069131564]
module.app["df-all-screens-scrape"].module.service["web"].module.ecr["this"].data.aws_caller_identity.current: Reading...
module.app["column-sandbox"].module.service["web"].module.ecr["this"].data.aws_caller_identity.current: Reading...
module.app["df-all-screens-scrape"].module.service["web"].module.ecr["this"].data.aws_caller_identity.current: Read complete after 0s [id=816069131564]
module.app["df-all-screens-scrape"].module.service["web"].module.ecr["this"].data.aws_partition.current: Reading...
module.app["column-sandbox"].module.service["web"].module.ecr["this"].data.aws_caller_identity.current: Read complete after 0s [id=816069131564]
module.app["df-all-screens-scrape"].module.service["web"].module.ecr["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.app["dc-sebt-portal"].module.service["web"].module.ecr["this"].data.aws_partition.current: Reading...
module.app["column-sandbox"].module.service["web"].module.ecr["this"].data.aws_partition.current: Reading...
module.app["column-sandbox"].module.service["web"].module.ecr["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.app["dc-sebt-portal"].module.service["web"].module.ecr["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2856726747]
module.app["df-all-screens-scrape"].module.service["web"].module.ecr["this"].data.aws_iam_policy_document.repository[0]: Reading...
module.app["df-all-screens-scrape"].module.service["web"].module.ecr["this"].data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=77330188]
module.app["dc-sebt-portal"].module.service["web"].module.ecr["this"].data.aws_iam_policy_document.repository[0]: Reading...
module.app["dc-sebt-portal"].module.service["web"].module.ecr["this"].data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=77330188]
module.app["column-sandbox"].module.service["web"].module.ecr["this"].data.aws_iam_policy_document.repository[0]: Reading...
module.app["column-sandbox"].module.service["web"].module.ecr["this"].data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=77330188]
module.app["dc-sebt-portal"].module.service["web"].data.aws_ssm_parameter.version["/sebt-portal/development/web/version"]: Reading...
module.app["column-sandbox"].module.service["web"].data.aws_ssm_parameter.version["/column-sandbox/development/web/version"]: Reading...
module.app["df-all-screens-scrape"].module.service["web"].data.aws_ssm_parameter.version["/df-all-screens-scrape/development/web/version"]: Reading...
module.app["dc-sebt-portal"].module.service["web"].data.aws_ssm_parameter.version["/sebt-portal/development/web/version"]: Read complete after 1s [id=/sebt-portal/development/web/version]
module.app["column-sandbox"].module.service["web"].data.aws_ssm_parameter.version["/column-sandbox/development/web/version"]: Read complete after 1s [id=/column-sandbox/development/web/version]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Reading...
module.app["df-all-screens-scrape"].module.service["web"].data.aws_ssm_parameter.version["/df-all-screens-scrape/development/web/version"]: Read complete after 0s [id=/df-all-screens-scrape/development/web/version]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Read complete after 0s [id=1808222790]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Read complete after 0s [id=2644592029]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Read complete after 0s [id=1315226949]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Read complete after 0s [id=3795168285]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Read complete after 0s [id=195798706]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Read complete after 0s [id=2187510914]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Read complete after 0s [id=874300523]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.app["column-sandbox"].module.service["web"].module.efs["data"].data.aws_iam_policy_document.policy[0]: Reading...
module.app["column-sandbox"].module.service["web"].module.efs["data"].data.aws_iam_policy_document.policy[0]: Read complete after 0s [id=557538529]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

OpenTofu will perform the following actions:

  # module.app["column-sandbox"].module.service["web"].aws_acm_certificate.endpoint["this"] must be replaced
+/- resource "aws_acm_certificate" "endpoint" {
      ~ arn                       = "arn:aws:acm:us-east-1:816069131564:certificate/c41c4706-6f7c-47e9-94be-aa9afa48676a" -> (known after apply)
      ~ domain_name               = "tax.dev.services.cfa.codes" -> "column.tax.dev.services.cfa.codes" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "tax.dev.services.cfa.codes"
              - resource_record_name  = "_82213c2e99009b1b7ee45d690aab3067.tax.dev.services.cfa.codes."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_6b33471f7028538135925dc899ed7f3c.xlfgrmvvlj.acm-validations.aws."
            },
          + {
              + domain_name           = "column.tax.dev.services.cfa.codes"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-east-1:816069131564:certificate/c41c4706-6f7c-47e9-94be-aa9afa48676a" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2026-07-24T23:59:59Z" -> (known after apply)
      ~ not_before                = "2025-06-25T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          - "tax.dev.services.cfa.codes",
          + "column.tax.dev.services.cfa.codes",
        ]
        tags                      = {
            "application" = "column-sandbox-development"
            "environment" = "development"
            "program"     = "tax-benefits"
            "project"     = "column-sandbox"
        }
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ options {
          + arn                       = (known after apply)
          + certificate_authority_arn = (known after apply)
          + certificate_body          = (known after apply)
          + certificate_chain         = (known after apply)
          + domain_name               = (known after apply)
          + domain_validation_options = (known after apply)
          + early_renewal_duration    = (known after apply)
          + id                        = (known after apply)
          + key_algorithm             = (known after apply)
          + not_after                 = (known after apply)
          + not_before                = (known after apply)
          + pending_renewal           = (known after apply)
          + private_key               = (known after apply)
          + renewal_eligibility       = (known after apply)
          + renewal_summary           = (known after apply)
          + status                    = (known after apply)
          + subject_alternative_names = (known after apply)
          + tags                      = (known after apply)
          + tags_all                  = (known after apply)
          + type                      = (known after apply)
          + validation_emails         = (known after apply)
          + validation_method         = (known after apply)
        } -> (known after apply)
    }

  # module.app["column-sandbox"].module.service["web"].aws_acm_certificate_validation.endpoint["this"] must be replaced
-/+ resource "aws_acm_certificate_validation" "endpoint" {
      ~ certificate_arn         = "arn:aws:acm:us-east-1:816069131564:certificate/c41c4706-6f7c-47e9-94be-aa9afa48676a" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "2025-06-25 19:28:50.907 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [ # forces replacement
          - "_82213c2e99009b1b7ee45d690aab3067.tax.dev.services.cfa.codes",
        ] -> (known after apply) # forces replacement
    }

  # module.app["column-sandbox"].module.service["web"].aws_route53_record.endpoint["this"] must be replaced
-/+ resource "aws_route53_record" "endpoint" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "tax.dev.services.cfa.codes" -> (known after apply)
      ~ id                               = "Z088564232NGJRO0LYHKL_tax.dev.services.cfa.codes_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "tax.dev.services.cfa.codes" -> "column.tax.dev.services.cfa.codes" # forces replacement
      - records                          = [] -> null
      - ttl                              = 0 -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.app["column-sandbox"].module.service["web"].aws_route53_record.endpoint_validation["column.tax.dev.services.cfa.codes"] will be created
  + resource "aws_route53_record" "endpoint_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z088564232NGJRO0LYHKL"
    }

  # module.app["column-sandbox"].module.service["web"].aws_route53_record.endpoint_validation["tax.dev.services.cfa.codes"] will be destroyed
  # (because key ["tax.dev.services.cfa.codes"] is not in for_each map)
  - resource "aws_route53_record" "endpoint_validation" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_82213c2e99009b1b7ee45d690aab3067.tax.dev.services.cfa.codes" -> null
      - id                               = "Z088564232NGJRO0LYHKL__82213c2e99009b1b7ee45d690aab3067.tax.dev.services.cfa.codes._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_82213c2e99009b1b7ee45d690aab3067.tax.dev.services.cfa.codes" -> null
      - records                          = [
          - "_6b33471f7028538135925dc899ed7f3c.xlfgrmvvlj.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z088564232NGJRO0LYHKL" -> null
    }

  # module.app["column-sandbox"].module.service["web"].module.alb["this"].aws_lb_listener.this["https"] will be updated in-place
  ~ resource "aws_lb_listener" "this" {
      ~ certificate_arn                      = "arn:aws:acm:us-east-1:816069131564:certificate/c41c4706-6f7c-47e9-94be-aa9afa48676a" -> (known after apply)
        id                                   = "arn:aws:elasticloadbalancing:us-east-1:816069131564:listener/app/col-sbox-development-web/1d511bd9675f0d81/713c7edda598c13f"
        tags                                 = {
            "application"           = "column-sandbox-development"
            "environment"           = "development"
            "program"               = "tax-benefits"
            "project"               = "column-sandbox"
            "terraform-aws-modules" = "alb"
        }
        # (7 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.app["dc-sebt-portal"].module.service["web"].module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
      + force_delete                       = true
        id                                 = "arn:aws:ecs:us-east-1:816069131564:service/sebt-portal-development-web/sebt-portal-development-web"
        name                               = "sebt-portal-development-web"
        tags                               = {
            "application" = "sebt-portal-development"
            "environment" = "development"
            "program"     = "safety-net"
            "project"     = "sebt-portal"
        }
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
      + force_delete                       = true
        id                                 = "arn:aws:ecs:us-east-1:816069131564:service/df-all-screens-scrape-development-web/df-all-screens-scrape-development-web"
        name                               = "df-all-screens-scrape-development-web"
        tags                               = {
            "application" = "df-all-screens-scrape-development"
            "environment" = "development"
            "program"     = "tax-benefits"
            "project"     = "df-all-screens-scrape"
        }
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 4 to add, 3 to change, 4 to destroy.

Changes to Outputs:
  ~ apps = {
      ~ column-sandbox        = {
          ~ services   = {
              ~ web = {
                  ~ endpoint_url               = "tax.dev.services.cfa.codes" -> (known after apply)
                    # (7 unchanged attributes hidden)
                }
            }
            # (1 unchanged attribute hidden)
        }
        # (2 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```